[
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9615747",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "XXXX XXXX XXXX XXXX, XXXX  XXXX XXXX, NY XXXX XXXX XXXX Date To : Macys XXXX Inc XXXX XXXX XXXX XXXXXXXX XXXX XXXX, NY XXXX Attn : XXXX XXXX Executive Office Dear XXXX XXXX, My name is XXXX XXXX, and I am writing to address the ongoing issues with my Macys credit account ( Account Number : XXXX ). Despite multiple attempts to resolve these matters over the phone, I have not received the necessary assistance to correct the inaccuracies on my account. \n\nXXXX. Disputed Charge and Lack of Support : I have called Macys customer service many times to dispute a charge of {$31.00} and address other concerns. Each time, the representatives were either unwilling or unable to assist me effectively. Macys should have records of these calls to verify my repeated efforts. \nXXXX. Late Fee : I acknowledge the late fee of {$31.00} charged on XX/XX/year>, and its subsequent credit on XX/XX/year>. However, this does not resolve the main issue of incorrect reporting. \nXXXX Credit Reporting Inaccuracy : My account was reported as 30 days delinquent in XX/XX/year>. I have consistently disputed this information, stating that payments for XXXX and XX/XX/year> were made but not properly applied to my account. \n\nAdditional Impact : Due to this delinquency on my credit report, my auto insurance increased to {$330.00} per month. This has been a significant financial burden. \n\nI request that Macys conduct a comprehensive review, including the phone call records, and correct the inaccuracies on my account. Additionally, I request the removal of the disputed by consumer note from my credit report once the issue is resolved. \n\nAdditionally, I do not want any Macys advertisements sent to my apartment. \n\nI hope to resolve this matter amicably and promptly. Thank you for your attention to this important issue. \n\nSincerely, XXXX XXXX",
            "date_sent_to_company": "2024-07-25T12:00:00-05:00",
            "issue": "Problem with a purchase shown on your statement",
            "sub_product": "Store credit card",
            "zip_code": "10701",
            "tags": null,
            "complaint_id": "9615747",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with monetary relief",
            "submitted_via": "Web",
            "company": "CITIBANK, N.A.",
            "date_received": "2024-07-25T12:00:00-05:00",
            "state": "NY",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Credit card company isn't resolving a dispute about a purchase on your statement"
        },
        "sort": [
            33
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9005055",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "Timely payments are always a priority for me, and I am certain about this. However, I am unsure why this company is reporting me as late in certain months, which should not be the case. According to USC 1666b, any billing error should be corrected, or they will be liable to pay me {$1000.00} for each account reporting inaccurately.",
            "date_sent_to_company": "2024-05-14T12:00:00-05:00",
            "issue": "Problem with a company's investigation into an existing problem",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "37042",
            "tags": null,
            "complaint_id": "9005055",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with explanation",
            "submitted_via": "Web",
            "company": "EQUIFAX, INC.",
            "date_received": "2024-05-14T12:00:00-05:00",
            "state": "TN",
            "consumer_disputed": "N/A",
            "company_public_response": null,
            "sub_issue": "Their investigation did not fix an error on your report"
        },
        "sort": [
            40
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9154222",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "I never miss a payment. I am certain of this. I dont get why this company is marking me late for some months. USC 1666b states that billing errors should be corrected and shown as paid on time.",
            "date_sent_to_company": "2024-06-02T12:00:00-05:00",
            "issue": "Problem with a company's investigation into an existing problem",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "77041",
            "tags": null,
            "complaint_id": "9154222",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with explanation",
            "submitted_via": "Web",
            "company": "Experian Information Solutions Inc.",
            "date_received": "2024-06-02T12:00:00-05:00",
            "state": "TX",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Their investigation did not fix an error on your report"
        },
        "sort": [
            128
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9157176",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "I purchased a XXXX XXXX XXXX XXXX on XX/XX/XXXX, using my TD BANK XXXX XXXX credit account. Phone was supposed to be delivered XX/XX/XXXX. Instead I get a delivery delayed notice. I contact XXXX and they tell me they will not ship the phone because XXXXXXXX XXXX was not authorizing the transaction. I reached out to XXXXXXXX XXXX and waited in cues a total of over 6 hours only to be hung up on 2 times. I also emailed their listed customer service department seeking help, because once I logged into my account not only did I find that they did authorize the transaction on XX/XX/XXXX, they authorized it again on XX/XX/XXXX. My current card balance is sitting at double, so {$2400.00}. But even with proof that the transaction is complete, XXXX is not releasing the product I was charged for twice.",
            "date_sent_to_company": "2024-06-04T12:00:00-05:00",
            "issue": "Problem with a purchase shown on your statement",
            "sub_product": "Store credit card",
            "zip_code": "385XX",
            "tags": null,
            "complaint_id": "9157176",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with monetary relief",
            "submitted_via": "Web",
            "company": "TD BANK US HOLDING COMPANY",
            "date_received": "2024-06-01T12:00:00-05:00",
            "state": "TN",
            "consumer_disputed": "N/A",
            "company_public_response": null,
            "sub_issue": "Overcharged for something you did purchase with the card"
        },
        "sort": [
            203
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9628394",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "Citi Bank has closed all my credit cards with them which includes my two Home Depot credit cards, Macys amex card, and Citi world elite master card. Citi banks explanation for closing my accounts was \" shows you have too many open revolving credit accounts '' This is a false cause because I have not had any new accounts for over 3 years and I don't have that many accounts. My credit has been exactly the same for the past 4 years and I have been with citi since 2017 and have never missed a payment nor any delinquencies. My credit is over an XXXX score and I don't have any lates or discrepancies. Citi has been recently fined by the cfpb for closing bank accounts for XXXX  people with last name ending in XXXX or XXXX. I am a victim of this XXXX. I will move forward with a lawyer if citi does not re open my accounts because this is XXXX  and discrimination just because I am an XXXX. I have had credit for over 20 years and never had a bank close my accounts ever. I have wonderful credit which I have proof of. Citi bank must reopen all my account I have had years of wonderful credit history with them and never gave a reason for an account closure. The only explanation as my lawyer said was me being XXXX. Please help me.",
            "date_sent_to_company": "2024-07-26T12:00:00-05:00",
            "issue": "Closing your account",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "91504",
            "tags": null,
            "complaint_id": "9628394",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with explanation",
            "submitted_via": "Web",
            "company": "CITIBANK, N.A.",
            "date_received": "2024-07-26T12:00:00-05:00",
            "state": "CA",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Company closed your account"
        },
        "sort": [
            211
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9636443",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "The following account is hurting my credit rating, credit standing, and credit capacity Wells Fargo [ Account # XXXX ]. Pursuant to section 623 ( b ) ( 1 ) ( E ) ( ii ) I am demanding that this agency removes this account from all of my consumer reports as it is inaccurate, incomplete, and/or unverifiable. This account was removed from a consumer reporting agency because it did not comply with the FCRA therefore as a supporting documentation, your agency now has a reasonable cause to believe that the furnished information is inaccurate and must be permanently removed from my consumer reports.",
            "date_sent_to_company": "2024-07-27T12:00:00-05:00",
            "issue": "Improper use of your report",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "96793",
            "tags": null,
            "complaint_id": "9636443",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with non-monetary relief",
            "submitted_via": "Web",
            "company": "WELLS FARGO & COMPANY",
            "date_received": "2024-07-27T12:00:00-05:00",
            "state": "HI",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Reporting company used your report improperly"
        },
        "sort": [
            1150
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9496999",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "I have a credit card through Best Buy Citi Bank that had fraud charges on the card. I was contacted by the Fraud Department and told to place a special name number etc. on my account so the fraud people accessing my account could no longer access the account. So I did that. And again the people in the same state are being allowed to access my account. Best Buy Citi Bank Customer Service did not protect me from fraud and again allowed fraudulent people to access my account. The specialized word or password which should have never been bypassed was bypassed. The fraud people changed my address, phone numbers and email. The Citi Bank Customer Service are not honoring my privacy and continually allow the fraud people to use my account without my permission.",
            "date_sent_to_company": "2024-07-19T12:00:00-05:00",
            "issue": "Other features, terms, or problems",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "XXXXX",
            "tags": null,
            "complaint_id": "9496999",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with monetary relief",
            "submitted_via": "Web",
            "company": "CITIBANK, N.A.",
            "date_received": "2024-07-12T12:00:00-05:00",
            "state": "NM",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Problem with customer service"
        },
        "sort": [
            1189
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9060579",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "I am a XXXX and I requested a pin for a cash advance. Once they received notification of that request I get an email that they lowered my limit from {$20000.00} to XXXX my balance was around XXXX on one card and they lowered the limit on both cards. I called them and they stated based on credit. credit was never pulled and in fact my scores increased to over XXXX. I don't have any delinquencies or blemishes on my credit. my scores are high because my balances are not maxed out. I'm very cognoscente of my credit because of what i do for a living. I particular use this card because it give me airline points for free tickets. I believe that the mere fact that I requested a cash advance alerted them to assume that there is financial difficulty, and they lowered my balances which has now affected my score. lowering my limit to my actual balance dropped my score XXXX points because it looks like I now have two cards maxed out. You can not offer the benefit to a customer cash advance and the minute they want to use that benefit you flag them. I want my limit increased back to where it was to increase my score. they can also close my account but increase my limit so my score is back where it was. i do not wish to use them or patronize them any longer. this is not the type of business tactics I want to be associated with. I have found that they have done this to several people and there's no recourse. it's not fair that they drew me in with the benefits and as soon as i tried to use them im penalized. they have no proof that my credit was a factor because my credit is excellent, well was since they lowered my limit and score has been affected",
            "date_sent_to_company": "2024-05-22T12:00:00-05:00",
            "issue": "Problem with a company's investigation into an existing problem",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "197XX",
            "tags": "Servicemember",
            "complaint_id": "9060579",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with explanation",
            "submitted_via": "Web",
            "company": "CITIBANK, N.A.",
            "date_received": "2024-05-22T12:00:00-05:00",
            "state": "DE",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Problem with personal statement of dispute"
        },
        "sort": [
            1451
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9474341",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "THE CONTRACT STATES A LINE OF CREDIT THAT IS FDIC INSURED IN THE AMOUNT OF {$250000.00}. WITH THIS ACCOUNT SET UP AND ESTABLISHED IT'S NOT SUBJECT TO A CREDIT REPORT IT STATES IN THE CONTRACT A LINE OF CREDIT WHICH ENTITLES ME TO MORE THAN {$3000.00} AND I DON'T EXCEPT JUST {$3000.00} IT'S NOT ENOUGH.WHATEVER HAPPENED TO THE RIGHTS THAT I'M ENTITLED TO UNDER THE BILL OF EXCHANGE ACT IS THAT NOT IRRELEVANT HERE AT ALL. I'M NEVER LETTING IT GO BECAUSE IF I WAS WHITE I WOULDN'T BE HAVING THIS PROBLEM AT ALL I'M XXXX",
            "date_sent_to_company": "2024-07-18T12:00:00-05:00",
            "issue": "Trouble using your card",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "63136",
            "tags": "Servicemember",
            "complaint_id": "9474341",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with explanation",
            "submitted_via": "Web",
            "company": "U.S. BANCORP",
            "date_received": "2024-07-10T12:00:00-05:00",
            "state": "MO",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Credit card company won't increase or decrease your credit limit"
        },
        "sort": [
            1624
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9565885",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "On XX/XX/year> I charged {$2600.00} on XXXX XXXX XXXX CitiBank ) credit card. Towards the end of XXXX had to leave XXXX to XXXX. I set up ebill account with CitiBank to make remote payments. In XXXX I received, email stating that my CitiBank ebill set up failed. I tried to contact Citibank to pay the full amount. No way to pay. Upon returning to XXXX I had the followint charges. : XXXX {$26.00} XXXX {$110.00}. XXXX \nXXXX {$140.00} XXXX {$180.00} Upon returning I called the CitiBank to explain the situation. I have had a Macys ' ( Citibank ) account for 40 years. Never missed a payment and have a XXXX XXXX of XXXX for good management of all my credit cards and debt. \nCitibank 's interest rate is XXXX XXXX so I was patronisingly told. I was willing to pay some charges but not exorbitant, usuary interest without consideration of my excellent credit management.. Made payments and they still asked for more interest fees. Last call they stated that they had closed my account without my request. My XXXX XXXX has dropped. No good will for prompt payments in the past and no reduction of interest for good customers. Citibank has extorted me for a charge of {$26.00} with a total final payments of {$280.00} in 5 months. Hate to think what is happening to other consumers. I tried to retrieve my charge information on their website and my account is not valid because they closed my account without my request. The representative stated that they had closed my account due to nonpayment, yet I had paid all the fees thay requested. I fear they wanted to erase me from their system since I stated that I would escalate the overcharged interest.",
            "date_sent_to_company": "2024-07-20T12:00:00-05:00",
            "issue": "Fees or interest",
            "sub_product": "Store credit card",
            "zip_code": "34203",
            "tags": "Older American",
            "complaint_id": "9565885",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with monetary relief",
            "submitted_via": "Web",
            "company": "CITIBANK, N.A.",
            "date_received": "2024-07-20T12:00:00-05:00",
            "state": "FL",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Charged too much interest"
        },
        "sort": [
            1868
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9170842",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "On XX/XX/XXXX, I booked a trip on XXXX XXXX XXXX XXXX, XXXX XXXX, but right after I paid, I realized that Ive put the wrong dates by mistake I was very worried because I did see the non-refundable policy from this property on the detail page. And I also checked the correct dates were actually not available to book, so there was no way to ask for a modification of my booking. Since it was midnight and no XXXX customer agents were available at that time, I only had to contact XXXX  credit card customer service to ask if there was anything they could do to help me with this case. \n\nThe agent on the call, the agent assured me that in this case, I could wait a few days for the pending charge to be posted, and cancel the service and submit a dispute, and eventually get money back with XXXX help. I was hopeful from what the agent told me, so I did what she told me to do, saw the pending charge posted on XX/XX/XXXX, canceled the stay with XXXX the same day, tried to work with them to get the dates modified or get the full refund but all failed. So I submitted a dispute, hoping to get my money back through my bank. After waiting for a few months, I got a rejection from XXXX for my dispute. I called XXXX customer service again to explain what happened and what the previous agent promised me. The new agent asked me to re-open the dispute by submitting supporting documents, which I did what she said. The case was re-opened but I was not being contacted or notified for the final results. I have been tracking the dispute process on my app though for a few months, and no updates until recently, the case was closed quietly. No notification, no contact from the bank, it secretly closed. And of course, I did not get my money back or even get an explanation. \n\nSince I did not actually stay at the property, I believe they did not have any losses due to this however, I lost {$XXXX} for nothing. XXXX it was caused by my own mistake in the first place, but I acted very quickly to try to correct the mistake, although the policy was too strict for me to do so. Moreover, what the first agent told me made me feel confident to get my money back with XXXX help, which turned out to be not, which is very frustrating : (. And the fact that no communication afterward is also frustrating. I hope XXXX  can help me get my money back as I indeed did not use the service at all. \n\nAlso I was unfortunately impacted by a mass layoff in XX/XX/XXXX, and not yet found a job due to the harsh market. {$XXXX} bucks would really mean a lot to me at this challenging time. I sincerely appreciate it.",
            "date_sent_to_company": "2024-06-05T12:00:00-05:00",
            "issue": "Problem with a purchase shown on your statement",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "91791",
            "tags": null,
            "complaint_id": "9170842",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with explanation",
            "submitted_via": "Web",
            "company": "JPMORGAN CHASE & CO.",
            "date_received": "2024-06-05T12:00:00-05:00",
            "state": "CA",
            "consumer_disputed": "N/A",
            "company_public_response": null,
            "sub_issue": "Credit card company isn't resolving a dispute about a purchase on your statement"
        },
        "sort": [
            2083
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9216992",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "I urge you to promptly remove this late payment from my account, as it does not accurately reflect my payment history. I have consistently made timely payments, and it is unacceptable to have this erroneous entry listed. Please update my account promptly.",
            "date_sent_to_company": "2024-06-11T12:00:00-05:00",
            "issue": "Incorrect information on your report",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "46375",
            "tags": null,
            "complaint_id": "9216992",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with non-monetary relief",
            "submitted_via": "Web",
            "company": "Experian Information Solutions Inc.",
            "date_received": "2024-06-11T12:00:00-05:00",
            "state": "IN",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Account status incorrect"
        },
        "sort": [
            2512
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9015004",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "I consistently make timely payments. I'm certain about this. What I'm unsure about is why this company is reporting me as late for certain months, which shouldn't be the case. According to USC 1666b, any billing errors should be corrected, or they'll be liable to pay me {$1000.00} for each account reporting inaccurately.",
            "date_sent_to_company": "2024-05-15T12:00:00-05:00",
            "issue": "Problem with a company's investigation into an existing problem",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "60426",
            "tags": null,
            "complaint_id": "9015004",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with non-monetary relief",
            "submitted_via": "Web",
            "company": "TRANSUNION INTERMEDIATE HOLDINGS, INC.",
            "date_received": "2024-05-15T12:00:00-05:00",
            "state": "IL",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Their investigation did not fix an error on your report"
        },
        "sort": [
            2552
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9676290",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "In XX/XX/XXXX I was notified by an identity protection provider that several credit cards were opened or attempted to be opened in my name. \nOn or about XX/XX/XXXX, I was contacted by XXXX police department that my personal information including my Social security number, a credit card statement and other personal information was obtained during a search of a residence in XXXX  XXXX. I filed a police report with the XXXX Police Department on XX/XX/XXXX. Police report # XXXX. I reported there were 11-12 attempts to open credit cards in mine and/or my wife 's name. \nXX/XX/XXXX I faxed all of the information to Barclay 's for the first time. \nThat information included the XXXX policy report # XXXX. \nOn or around XX/XX/XXXX, I received a restitution letter from XXXX XXXX XXXX, District Attorney, XXXX XXXX XXXX XXXX XXXX, State of Oklahoma that I was a victim of a crime. Case # XXXX State of Oklahoma XXXX XXXX XXXX XXXX XXXX I filled out the Itemized restitution request letter informing them that a XXXX rewards credit card issued by Barclay 's Bank had been taken out and purchases in the amount of {$980.00} were made on the card. \nThe card in question I later received the credit card at my residence. \nI contacted Barclay 's bank with the assistance of XXXX from my XXXX XXXX XXXX and informed Barclay 's the card was taken out fraudulently and I wanted it investigated. The card was placed on suspension and was investigated. I received a letter from Barclay 's that after investigation, they concluded the card was not taken out fraudulently. \nI have sent Barclay 's the police report 3 times. Two times via fax and 1 time regular mail. A copy of the restitution letter from the District Attorney and have called Barclay 's approximately 25 times explained the situation and every time it's the same response. \nI'm told it will be investigated and in a few days I received a letter explaining that they have concluded their investigation and no fraudulent activity found. \nThe entire ordeal included approximately 17credit cards being taken out or trying to be taken out in mine or my wife name and SSN.\n\nBarclay 's is the only card remaining that has not recognized the illegal activity in my name",
            "date_sent_to_company": "2024-08-01T12:00:00-05:00",
            "issue": "Getting a credit card",
            "sub_product": "Store credit card",
            "zip_code": "73034",
            "tags": null,
            "complaint_id": "9676290",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with explanation",
            "submitted_via": "Web",
            "company": "BARCLAYS BANK DELAWARE",
            "date_received": "2024-08-01T12:00:00-05:00",
            "state": "OK",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Card opened without my consent or knowledge"
        },
        "sort": [
            3523
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9102086",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "As per my American Express credit card statement with Closing Date XX/XX/XXXX, I had to pay a minimum of {$40.00} by XXXX XXXX. On XXXX XXXX, I submitted a payment from my bank. Unfortunately, the bank did not process the payment until XXXX XXXX. Nonetheless, I have been informed in the past by support staff at American Express that they go by the date that the payment was submitted and so in theory I should not have had to pay any late fee. \n\nHowever, as per the Statement with a Closing Date XX/XX/XXXX, I received notice that I am supposed to pay a Late Payment Fee of {$29.00} plus Interest Charge on Pay Over Time Purchases of {$2.00}. This is for an outstanding amount of only {$82.00}. This is altogether a fee of 38.5 %. \n\nThis would seem to clearly go against the rule of the Consumer Financial Protection Bureau that limits such payments to {$8.00} per month [ SEE CFPB Bans Excessive Credit Card Late Fees, Lowers Typical Fee from {$32.00} to {$8.00} announced on XX/XX/XXXX. Accessed XXXX XX/XX/XXXX at XXXX : XXXX ] I called American Express Customer Service XXXX XXXX XXXX and spoke to an agent. I questioned the charges and I specifically invoked the CPFB rule. Even after the agent spoke with his supervisor, there was no movement on the side of American Express. I informed them that I would be forced to submit a complaint to the Consumer Financial Protection Bureau and would probably terminate my account with American Express as a result of this treatment but this made no difference at all.",
            "date_sent_to_company": "2024-05-27T12:00:00-05:00",
            "issue": "Fees or interest",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "XXXXX",
            "tags": null,
            "complaint_id": "9102086",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with explanation",
            "submitted_via": "Web",
            "company": "AMERICAN EXPRESS COMPANY",
            "date_received": "2024-05-27T12:00:00-05:00",
            "state": null,
            "consumer_disputed": "N/A",
            "company_public_response": null,
            "sub_issue": "Problem with fees"
        },
        "sort": [
            4610
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9676729",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "XX/XX/XXXX I was informed by XXXX in Fraud that charges had been made at Macys in XXXX CA that amounted in {$1000.00} the change took place on XX/XX/XXXX. I told them it was fraud it was investigated and removed. On XX/XX/XXXX I was contacted by the XXXX XXXX in my area that the XXXX XXXX XXXX needed to contact them ASAP. I was told they had arrested XXXX people in XXXX that had ID my my information but clearly werent me since they were XXXX. XX/XX/XXXX XXXX took place at XXXX. Based on this information security was placed on both cards. XX/XX/XXXX I started receiving calls from Macys so they said they spoke about an an account I had paid off, so I hung up and called back thinking this was another scam. I spoke with XXXX in Fraud and she assured me she would send the issue forward. In became frustrated that I closed the account and asked that only payments being allowed. XX/XX/XXXX I was informed that there had been an account opened in XXXX XXXX XXXX I told them that was not my account and I was assured by XXXX XXXX for XXXX that the matter would be investigated. I gave them the case # XXXX the officer explained that mail was stolen from my mail box and many others in the area.",
            "date_sent_to_company": "2024-07-31T12:00:00-05:00",
            "issue": "Getting a credit card",
            "sub_product": "Store credit card",
            "zip_code": "94565",
            "tags": "Older American",
            "complaint_id": "9676729",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with non-monetary relief",
            "submitted_via": "Web",
            "company": "CITIBANK, N.A.",
            "date_received": "2024-07-31T12:00:00-05:00",
            "state": "CA",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Card opened without my consent or knowledge"
        },
        "sort": [
            4738
        ]
    },
    {
        "_index": "complaint-public-v2",
        "_type": "_doc",
        "_id": "9637748",
        "_score": null,
        "_source": {
            "product": "Credit card",
            "complaint_what_happened": "I opened a secured credit card with my own money. The amount deposited was {$1000.00} which I was told would be my credit limit. Upon entering into the agreement, I inquired about the secure card being transitioned into a revolving account. I was advised as well as it was outlined in terms and agreements that once I maintained a positive payment history for a year my account would automatically transition into a revolving account. I maintained my account in great standing for over the time period allowed, how the agents kept creating unfounded claims and stipulations to push back the maturity date. Never upholding the bank policy and procedures. I was advised by Citibank credit department that my account did actually qualify. My account was never transitioned. \n\nIn addition to failing to adhere to secured card policies, claims were not properly adjudicated and Citibank blocked my access to account to view transactions, prevented me from filing a claim and closed my account without cause or notification. \n\nCitibank then erroneously reported my account to the credit bureaus as a late payment account and charged off account. This is not the case. Also, the funds were my own. Citibank reported my account as a revolving account, However, I was advised by Citibank card services that this was never transferred to a revolving account. I secure card account was never in default. Citibank reported my account was charged off owing {$450.00} of the {$1000.00}. There was no possible way this is owed because the limit was only {$1000.00} and the account will not allow for transactions to process over the {$1000.00} Citibank is reporting my account fraudulently and legal action will be taken if this is not corrected with ALL credit reporting agencies.",
            "date_sent_to_company": "2024-07-28T12:00:00-05:00",
            "issue": "Closing your account",
            "sub_product": "General-purpose credit card or charge card",
            "zip_code": "91356",
            "tags": "Servicemember",
            "complaint_id": "9637748",
            "timely": "Yes",
            "consumer_consent_provided": "Consent provided",
            "company_response": "Closed with non-monetary relief",
            "submitted_via": "Web",
            "company": "CITIBANK, N.A.",
            "date_received": "2024-07-28T12:00:00-05:00",
            "state": "CA",
            "consumer_disputed": "N/A",
            "company_public_response": "Company has responded to the consumer and the CFPB and chooses not to provide a public response",
            "sub_issue": "Company closed your account"
        },
        "sort": [
            4949
        ]
    }
]